// src/data/footerData.ts

import InstagramIcon from "@mui/icons-material/Instagram";
import TelegramIcon from "@mui/icons-material/Telegram";
import WhatsAppIcon from "@mui/icons-material/WhatsApp";
import YouTubeIcon from "@mui/icons-material/YouTube";

export const socialLinks = [
  { icon: <InstagramIcon />, href: "https://instagram.com" },
  { icon: <TelegramIcon />, href: "https://t.me" },
  { icon: <WhatsAppIcon />, href: "https://wa.me" },
  { icon: <YouTubeIcon />, href: "https://youtube.com" },
];

export const footerColumns = [
  {
    title: "محبوب‌ترین‌ها",
    items: ["لباس مردانه", "کفش فوتبال", "دوچرخه", "لباس زنانه"],
  },
  {
    title: "خدمات مشتریان",
    items: [
      "سوالات متداول",
      "حریم خصوصی",
      "گزارش ایراد در سایت",
      "شرایط بازگرداندن محصول",
    ],
  },
  {
    title: "راهنمای خرید",
    items: [
      "راهنمای ثبت سفارش",
      "شیوه‌های پرداخت",
      "نحوه ارسال سفارش‌ها",
      "نحوه پیگیری محصول",
    ],
  },
  {
    title: "اطلاعات تماس",
    items: [
      "نشانی: تهران - تجریش - خیابان سالور",
      "شماره تماس: ۰۲۱-۳۴۵۶۷۸۹",
      "ایمیل: info@fitland.com",
      "ساعت کاری: شنبه تا چهارشنبه ۹ تا ۱۷",
    ],
  },
];

export const footerAbout =
  ".فروشگاه لوازم ورزشی فیت‌لند در سال 1403 کار خود را به صورت حرفه ای آغاز کرد و با هدف ارائه جدیدترین محصولات ورزشی از قبیل لوازم فوتبال، فوتسال، والیبال، بسکتبال، تنیس و... همچنین پوشاک ورزشی و تجهیزات سفر، از برند های معتبر دنیا در محیطی کاربرپسند، قابل اطمینان و با مجربترین مشاوران و کارشناسان ورزشی فعالیت می کند. فروشگاه فیت‌لند دارای نماد اعتماد از وزارت صنعت معدن و تجارت می باشد و تمامی محصولات خود را با 7 روز ضمانت بازگشت همراه با گارانتی اصالت و سلامت فیزیکی، با سریع ترین روش های ارسال به سراسر ایران در اختیار مشتریان خود قرار می دهد";

export const footerCopyright =
  "تمامی حقوق مادی و معنوی این وب‌سایت برای مجموعه فیت‌لند محفوظ می‌باشد.";

export const footerLinkGroups = [
  {
    title: "محبوب‌ترین‌ها",
    items: ["لباس مردانه", "کفش فوتبال", "دوچرخه", "لباس زنانه"],
  },
  {
    title: "خدمات مشتریان",
    items: [
      "سوالات متداول",
      "حریم خصوصی",
      "گزارش ایراد در سایت",
      "شرایط بازگرداندن محصول",
    ],
  },
  {
    title: "راهنمای خرید",
    items: [
      "راهنمای ثبت سفارش",
      "شیوه های پرداخت",
      "نحوه ارسال سفارش ها",
      "نحوه پیگیری محصول",
    ],
  },
  {
    title: "اطلاعات تماس",
    items: [
      "نشانی: تهران - تجریش - خیابان سالور",
      "شماره تماس: ۰۲۱-۳۴۵۶۴۷۸۹",
      "info@fitland.com",
      "ساعت کاری: شنبه تا چهارشنبه ۹ تا ۱۷",
    ],
  },
];
